'''
작성일 : 2023년 5월 24일
학과 : 컴퓨터공학과
학번 : 202395006
이름 : 김민재
설명 : 7장 세트와 딕셔너리
      02. 딕셔너리
예제 7-3
학번과 이름을 입력하여 사전에 저장한다.
학번을 입력 받아 해당 학생의 이름을 출력한다.
입력 받은 학번이 없으면 "입력한 학생이 존재하지 않습니다." 출력한다.
'''
#알고리즘
#1. 빈 딕셔너리 만든다. -학생 딕셔너리 만든다.
#2. 5번 반복하면서
#     1) 학번을 입력 받는다.
#     2) 이름을 입력 받는다.
#3. 저장된 학생 정보를 출력한다.
#4. 학번에 0이 입력 될 때까지 반복한다. (무한반복하면서)
#     1) 검색할 학번을 입력 받는다.
#     2) 만약에 학번이 0이면
#           1. 프로그램 종료
#     3) 아니면 만약 입력은 학번이 학생 딕셔너리에 존재한다면
#           1. 학생 딕셔너리에 입력 받은 학번의 값을 출력
#     4) 아니면
#           1. 입력한 학생이 존재하지 않습니다. 출력
dict1 = {}
for i in range(5):
    num = input(str(i+1) + "번째 학생의 학번을 입력해주세요. : ")
    name = input(str(i+1) +"번째 학생의 이름을 입력해주세요. : ")
    dict1[num] = name #해당 키에 값 저장
while True:
      num = input("학번을 입력해주세요. : ")
      if int(num) == 0:
            print("프로그램을 종료합니다.")
            break
      elif num in dict1.keys():
            print("=====검색한 학생 정보=====")
            print("학번 : ", num, "이름 : ", dict1.get(num))
      else:
            print("입력한 학생이 존재하지 않습니다.")
      